Revit 2027 API
FilterableValueProvider.GetElementIdValue Method
 Gets an ElementId value from the given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetElementIdValue(
	Element element
)
Public Function GetElementIdValue (
	element As Element
) As ElementId
public:
ElementId^ GetElementIdValue(
	Element^ element
)
member GetElementIdValue :
        element : Element -> ElementId
Parameters
element Element
 The element to query.
Return Value
ElementId
 The ElementId value from the element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FilterableValueProvider Class
Autodesk.Revit.DB Namespace